{
    "task_type": "CAUSAL_LM",
    "peft_type": "LORA",
    "auto_mapping": null,
    "base_model_name_or_path": "/data1/luofeng/RL/checkpoints/c2rust-sft-step-v3/qwen2.5-3B/global_step_2805",
    "revision": null,
    "inference_mode": false,
    "r": 32,
    "target_modules": [
        "down_proj",
        "v_proj",
        "gate_proj",
        "k_proj",
        "q_proj",
        "o_proj",
        "up_proj"
    ],
    "exclude_modules": null,
    "lora_alpha": 64,
    "lora_dropout": 0.0,
    "fan_in_fan_out": false,
    "bias": "none",
    "use_rslora": false,
    "modules_to_save": null,
    "init_lora_weights": true,
    "layers_to_transform": null,
    "layers_pattern": null,
    "rank_pattern": {},
    "alpha_pattern": {},
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "trainable_token_indices": null,
    "loftq_config": {},
    "eva_config": null,
    "corda_config": null,
    "use_dora": false,
    "use_qalora": false,
    "qalora_group_size": 16,
    "layer_replication": null,
    "runtime_config": {
        "ephemeral_gpu_offload": false
    },
    "lora_bias": false,
    "target_parameters": null
}